; domain
(define (domain delivery)
    (:requirements :typing :equality :negative-preconditions :constraints)
    (:types
        cell - object
        locatable - object
        package - locatable
        truck - locatable
    )

    (:predicates
        (at ?x1 - locatable ?x2 - cell)
        (carrying ?x1 - truck ?x2 - package)
        (empty ?x1 - truck)
        (adjacent ?x1 - cell ?x2 - cell)
    )

    (:action pick-package
     :parameters (?t - truck ?p - package ?x - cell)
     :precondition (and (at ?p ?x) (at ?t ?x) (empty ?t))
     :effect (and
        (not (at ?p ?x))
        (not (empty ?t))
        (carrying ?t ?p))
    )

    (:action drop-package
     :parameters (?t - truck ?p - package ?x - cell)
     :precondition (and (at ?t ?x) (carrying ?t ?p))
     :effect (and
        (empty ?t)
        (not (carrying ?t ?p))
        (at ?p ?x))
    )

    (:action move
     :parameters (?t - truck ?from - cell ?to - cell)
     :precondition (and (adjacent ?from ?to) (at ?t ?from) (not (= ?from ?to)))
     :effect (and
        (not (at ?t ?from))
        (at ?t ?to))
    )
)

; problem
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Instance file automatically generated by the Tarski FSTRIPS writer
;;; 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (problem delivery-5x5-5-854)
    (:domain delivery)

    (:objects
        c_0_0 c_0_1 c_0_2 c_0_3 c_0_4 c_1_0 c_1_1 c_1_2 c_1_3 c_1_4 c_2_0 c_2_1 c_2_2 c_2_3 c_2_4 c_3_0 c_3_1 c_3_2 c_3_3 c_3_4 c_4_0 c_4_1 c_4_2 c_4_3 c_4_4 - cell
        p1 p2 p3 p4 p5 - package
        t1 - truck
    )

    (:init
        (adjacent c_0_0 c_0_1)
        (adjacent c_1_4 c_2_4)
        (adjacent c_3_3 c_3_4)
        (adjacent c_0_4 c_0_3)
        (adjacent c_0_2 c_0_3)
        (adjacent c_2_4 c_1_4)
        (adjacent c_3_1 c_4_1)
        (adjacent c_2_4 c_2_3)
        (adjacent c_0_1 c_0_0)
        (adjacent c_1_1 c_1_0)
        (adjacent c_2_1 c_3_1)
        (adjacent c_3_1 c_3_2)
        (adjacent c_4_2 c_3_2)
        (adjacent c_1_0 c_1_1)
        (adjacent c_2_0 c_3_0)
        (adjacent c_4_1 c_4_0)
        (adjacent c_0_3 c_1_3)
        (adjacent c_1_3 c_1_4)
        (adjacent c_2_1 c_2_0)
        (adjacent c_2_3 c_3_3)
        (adjacent c_0_0 c_1_0)
        (adjacent c_0_3 c_0_4)
        (adjacent c_1_3 c_2_3)
        (adjacent c_1_2 c_2_2)
        (adjacent c_1_2 c_1_1)
        (adjacent c_2_3 c_2_4)
        (adjacent c_3_0 c_4_0)
        (adjacent c_1_4 c_1_3)
        (adjacent c_3_4 c_4_4)
        (adjacent c_4_2 c_4_1)
        (adjacent c_1_4 c_0_4)
        (adjacent c_4_0 c_3_0)
        (adjacent c_3_0 c_2_0)
        (adjacent c_4_3 c_3_3)
        (adjacent c_3_1 c_2_1)
        (adjacent c_4_1 c_3_1)
        (adjacent c_3_2 c_3_1)
        (adjacent c_4_3 c_4_2)
        (adjacent c_4_4 c_3_4)
        (adjacent c_3_3 c_4_3)
        (adjacent c_0_1 c_1_1)
        (adjacent c_2_0 c_1_0)
        (adjacent c_1_0 c_2_0)
        (adjacent c_3_0 c_3_1)
        (adjacent c_2_1 c_2_2)
        (adjacent c_1_3 c_0_3)
        (adjacent c_2_3 c_1_3)
        (adjacent c_3_1 c_3_0)
        (adjacent c_0_2 c_1_2)
        (adjacent c_0_4 c_1_4)
        (adjacent c_4_2 c_4_3)
        (adjacent c_2_2 c_1_2)
        (adjacent c_2_3 c_2_2)
        (adjacent c_3_4 c_3_3)
        (adjacent c_1_1 c_1_2)
        (adjacent c_2_2 c_3_2)
        (adjacent c_2_2 c_2_3)
        (adjacent c_3_3 c_3_2)
        (adjacent c_1_0 c_0_0)
        (adjacent c_3_2 c_3_3)
        (adjacent c_4_3 c_4_4)
        (adjacent c_3_4 c_2_4)
        (adjacent c_1_1 c_2_1)
        (adjacent c_4_1 c_4_2)
        (adjacent c_0_3 c_0_2)
        (adjacent c_0_2 c_0_1)
        (adjacent c_0_1 c_0_2)
        (adjacent c_1_2 c_0_2)
        (adjacent c_2_1 c_1_1)
        (adjacent c_4_0 c_4_1)
        (adjacent c_3_2 c_4_2)
        (adjacent c_1_1 c_0_1)
        (adjacent c_2_4 c_3_4)
        (adjacent c_2_0 c_2_1)
        (adjacent c_1_3 c_1_2)
        (adjacent c_3_2 c_2_2)
        (adjacent c_1_2 c_1_3)
        (adjacent c_4_4 c_4_3)
        (adjacent c_2_2 c_2_1)
        (adjacent c_3_3 c_2_3)
        (at p1 c_4_3)
        (at p2 c_2_2)
        (at p3 c_4_0)
        (at p4 c_0_3)
        (at p5 c_3_2)
        (at t1 c_0_0)
        (empty t1)
    )

    (:goal
        (and (at p1 c_2_4) (and (at p2 c_2_4) (and (at p3 c_2_4) (and (at p4 c_2_4) (at p5 c_2_4)))))
    )

    
    
    

  (:constraints
    (and
      (always (not (at p1 c_0_0)))
      (always (not (at p2 c_0_0)))
      (always (not (at p3 c_0_0)))
      (always (not (at p4 c_0_0)))
      (always (not (at p5 c_0_0)))
    )
  )
)

; plan
1. (move t1 c_0_0 c_1_0)
   deleted: (at t1 c_0_0)
   added: (at t1 c_1_0)
   goals met: 0 of 2
2. (move t1 c_1_0 c_2_0)
   deleted: (at t1 c_1_0)
   added: (at t1 c_2_0)
   goals met: 0 of 2
3. (move t1 c_2_0 c_2_1)
   deleted: (at t1 c_2_0)
   added: (at t1 c_2_1)
   goals met: 0 of 2
4. (move t1 c_2_1 c_2_2)
   deleted: (at t1 c_2_1)
   added: (at t1 c_2_2)
   goals met: 0 of 2
5. (move t1 c_2_2 c_3_2)
   deleted: (at t1 c_2_2)
   added: (at t1 c_3_2)
   goals met: 0 of 2
6. (move t1 c_3_2 c_3_3)
   deleted: (at t1 c_3_2)
   added: (at t1 c_3_3)
   goals met: 0 of 2
7. (move t1 c_3_3 c_4_3)
   deleted: (at t1 c_3_3)
   added: (at t1 c_4_3)
   goals met: 0 of 2
8. (pick-package t1 p1 c_4_3)
   deleted: (at p1 c_4_3) (empty t1)
   added: (carrying t1 p1)
   goals met: 0 of 2
9. (move t1 c_4_3 c_4_2)
   deleted: (at t1 c_4_3)
   added: (at t1 c_4_2)
   goals met: 0 of 2
10. (move t1 c_4_2 c_3_2)
   deleted: (at t1 c_4_2)
   added: (at t1 c_3_2)
   goals met: 0 of 2
11. (move t1 c_3_2 c_2_2)
   deleted: (at t1 c_3_2)
   added: (at t1 c_2_2)
   goals met: 0 of 2
12. (move t1 c_2_2 c_2_3)
   deleted: (at t1 c_2_2)
   added: (at t1 c_2_3)
   goals met: 0 of 2
13. (move t1 c_2_3 c_2_4)
   deleted: (at t1 c_2_3)
   added: (at t1 c_2_4)
   goals met: 0 of 2
14. (drop-package t1 p1 c_2_4)
   deleted: (carrying t1 p1)
   added: (empty t1) (at p1 c_2_4)
   goals met: 1 of 2
15. (move t1 c_2_4 c_2_3)
   deleted: (at t1 c_2_4)
   added: (at t1 c_2_3)
   goals met: 1 of 2
16. (move t1 c_2_3 c_2_2)
   deleted: (at t1 c_2_3)
   added: (at t1 c_2_2)
   goals met: 1 of 2
17. (move t1 c_2_2 c_3_2)
   deleted: (at t1 c_2_2)
   added: (at t1 c_3_2)
   goals met: 1 of 2
18. (pick-package t1 p5 c_3_2)
   deleted: (at p5 c_3_2) (empty t1)
   added: (carrying t1 p5)
   goals met: 1 of 2
19. (move t1 c_3_2 c_2_2)
   deleted: (at t1 c_3_2)
   added: (at t1 c_2_2)
   goals met: 1 of 2
20. (move t1 c_2_2 c_2_3)
   deleted: (at t1 c_2_2)
   added: (at t1 c_2_3)
   goals met: 1 of 2
21. (move t1 c_2_3 c_2_4)
   deleted: (at t1 c_2_3)
   added: (at t1 c_2_4)
   goals met: 1 of 2
22. (drop-package t1 p5 c_2_4)
   deleted: (carrying t1 p5)
   added: (empty t1) (at p5 c_2_4)
   goals met: 1 of 2
23. (move t1 c_2_4 c_2_3)
   deleted: (at t1 c_2_4)
   added: (at t1 c_2_3)
   goals met: 1 of 2
24. (move t1 c_2_3 c_2_2)
   deleted: (at t1 c_2_3)
   added: (at t1 c_2_2)
   goals met: 1 of 2
25. (pick-package t1 p2 c_2_2)
   deleted: (at p2 c_2_2) (empty t1)
   added: (carrying t1 p2)
   goals met: 1 of 2
26. (move t1 c_2_2 c_2_3)
   deleted: (at t1 c_2_2)
   added: (at t1 c_2_3)
   goals met: 1 of 2
27. (move t1 c_2_3 c_2_4)
   deleted: (at t1 c_2_3)
   added: (at t1 c_2_4)
   goals met: 1 of 2
28. (drop-package t1 p2 c_2_4)
   deleted: (carrying t1 p2)
   added: (empty t1) (at p2 c_2_4)
   goals met: 1 of 2
29. (move t1 c_2_4 c_2_3)
   deleted: (at t1 c_2_4)
   added: (at t1 c_2_3)
   goals met: 1 of 2
30. (move t1 c_2_3 c_1_3)
   deleted: (at t1 c_2_3)
   added: (at t1 c_1_3)
   goals met: 1 of 2
31. (move t1 c_1_3 c_0_3)
   deleted: (at t1 c_1_3)
   added: (at t1 c_0_3)
   goals met: 1 of 2
32. (pick-package t1 p4 c_0_3)
   deleted: (at p4 c_0_3) (empty t1)
   added: (carrying t1 p4)
   goals met: 1 of 2
33. (move t1 c_0_3 c_0_4)
   deleted: (at t1 c_0_3)
   added: (at t1 c_0_4)
   goals met: 1 of 2
34. (move t1 c_0_4 c_1_4)
   deleted: (at t1 c_0_4)
   added: (at t1 c_1_4)
   goals met: 1 of 2
35. (move t1 c_1_4 c_2_4)
   deleted: (at t1 c_1_4)
   added: (at t1 c_2_4)
   goals met: 1 of 2
36. (drop-package t1 p4 c_2_4)
   deleted: (carrying t1 p4)
   added: (empty t1) (at p4 c_2_4)
   goals met: 1 of 2
37. (move t1 c_2_4 c_2_3)
   deleted: (at t1 c_2_4)
   added: (at t1 c_2_3)
   goals met: 1 of 2
38. (move t1 c_2_3 c_2_2)
   deleted: (at t1 c_2_3)
   added: (at t1 c_2_2)
   goals met: 1 of 2
39. (move t1 c_2_2 c_2_1)
   deleted: (at t1 c_2_2)
   added: (at t1 c_2_1)
   goals met: 1 of 2
40. (move t1 c_2_1 c_2_0)
   deleted: (at t1 c_2_1)
   added: (at t1 c_2_0)
   goals met: 1 of 2
41. (move t1 c_2_0 c_3_0)
   deleted: (at t1 c_2_0)
   added: (at t1 c_3_0)
   goals met: 1 of 2
42. (move t1 c_3_0 c_4_0)
   deleted: (at t1 c_3_0)
   added: (at t1 c_4_0)
   goals met: 1 of 2
43. (pick-package t1 p3 c_4_0)
   deleted: (at p3 c_4_0) (empty t1)
   added: (carrying t1 p3)
   goals met: 1 of 2
44. (move t1 c_4_0 c_3_0)
   deleted: (at t1 c_4_0)
   added: (at t1 c_3_0)
   goals met: 1 of 2
45. (move t1 c_3_0 c_2_0)
   deleted: (at t1 c_3_0)
   added: (at t1 c_2_0)
   goals met: 1 of 2
46. (move t1 c_2_0 c_2_1)
   deleted: (at t1 c_2_0)
   added: (at t1 c_2_1)
   goals met: 1 of 2
47. (move t1 c_2_1 c_2_2)
   deleted: (at t1 c_2_1)
   added: (at t1 c_2_2)
   goals met: 1 of 2
48. (move t1 c_2_2 c_2_3)
   deleted: (at t1 c_2_2)
   added: (at t1 c_2_3)
   goals met: 1 of 2
49. (move t1 c_2_3 c_2_4)
   deleted: (at t1 c_2_3)
   added: (at t1 c_2_4)
   goals met: 1 of 2
50. (drop-package t1 p3 c_2_4)
   deleted: (carrying t1 p3)
   added: (empty t1) (at p3 c_2_4)
   goals met: 2 of 2
